package week01.day4;

public class Ex03 {

	public static void main(String[] args) {

		/*
		10진수   2진수
		 2  ->  10(2)
		 3  ->  11(2)
		 20 -> 10100(2)
		*/
		
		/*
		
		10100(2)
		-> 8진수 : o24(8) // 2진수 3자리씩 표현
		->16진수 : o14(16)	// 2진수 4자리씩 표현
		
		
		// 보수 //
		// 컴퓨터는 뺄셈 인식X 덧셈으로함

		2의 보수 // 10(일영)을 만들기위한 보충되는 수 이다 
		00100(2) // 1의 보수 +1
		
		 11011 // 1의 보수
		+    1
	   합 11100 // 2의 보수
		 
		 00100 // 20
		+11100 // 20의 보수
	  합 100000 // 10(일영)의 상태임 -> 즉 값은 0이고 캐리(자리 올림)가 발생되는 상태
	  
	  	25 // 11001(2) // 2의 보수
	  	     +00111
	        합100000
		 */
		
		
	}

}
